1password
alacritty
bat
beeper-latest-bin
betterdiscord-installer
brave-bin
composer
discord
fastfetch
fd
firefox-developer-edition
julia
kitty
klavaro
lazygit
luarocks
neovim
nodejs-n
obsidian
openrazer-daemon
perl
php
polychromatic
ripgrep
ruby
s-nail
spotify-player
spotify-tui
spotifyd
timeshift
tree
visual-studio-code-bin
vivaldi
wget
zsh
