tap "common-fate/granted"
tap "derailed/k9s"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "jesseduffield/lazygit"
tap "jstkdng/programs"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sst/tap"

# =====================================
# SYSTEM LIBRARIES & DEPENDENCIES
# =====================================
brew "xz"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "zlib"

# =====================================
# VERSION MANAGEMENT
# =====================================
# mise - unified version manager for node, python, ruby, go, etc.
brew "mise"

# =====================================
# SHELL & PROMPT
# =====================================
brew "starship"

# =====================================
# DEVELOPMENT TOOLS
# =====================================

## Editors
brew "neovim"
brew "emacs"
brew "nano"
brew "nanorc"

## Git tools
brew "gh"
brew "lazygit"
brew "git-delta"

## Build tools
brew "automake"
brew "cmake"
brew "make"
brew "gcc"

## Container & Kubernetes
brew "docker"
brew "docker-credential-helper"
brew "colima"
brew "kubernetes-cli"
brew "helm"
brew "lazydocker"
brew "minikube"
brew "derailed/k9s/k9s"

## Infrastructure as Code
brew "hashicorp/tap/terraform"

## Cloud CLI tools
brew "common-fate/granted/granted"

## Programming languages
brew "php"
brew "composer"
brew "deno"
brew "julia"
brew "openjdk@21"

## Language tools
brew "luarocks"
brew "stylua"
brew "tree-sitter-cli"

# =====================================
# COMMAND LINE UTILITIES
# =====================================

## Modern replacements
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "thefuck"

## File management
brew "stow"
brew "tree"
brew "yazi"
brew "rsync"

## System utilities
brew "btop"
brew "fastfetch"
brew "watchman"
brew "pv"
brew "tldr"

## Compression & archives
brew "sevenzip"
brew "unrar"

## Text processing & search
brew "jq"
brew "grep"
brew "sed"

## Media & images
brew "imagemagick"
brew "ghostscript"
brew "poppler"
brew "ffmpegthumbnailer"

## Document processing
brew "pandoc"
brew "tectonic"
brew "mermaid-cli"

## Network tools
brew "curl"
brew "wget"
brew "mkcert"
brew "unbound"
brew "gnutls"

## Terminal & tmux
brew "tmux"
brew "tmuxinator"

## Python tooling (beyond mise)
brew "pipx"

## Database clients
brew "mysql-client"
brew "mysql@8.0"
brew "postgresql@14"

## Libraries
brew "libmagic"
brew "icu4c@76"
brew "jpeg"
brew "tcl-tk"

# =====================================
# SPOTIFY
# =====================================
brew "spotify_player"

# =====================================
# QMK FIRMWARE
# =====================================
brew "qmk/qmk/qmk"
brew "qemu"

# =====================================
# MACOS SPECIFIC TOOLS
# =====================================
brew "felixkratz/formulae/borders"

# =====================================
# OPENCODE (AI ASSISTANT)
# =====================================
brew "sst/tap/opencode"

# =====================================
# CASKS (GUI APPLICATIONS)
# =====================================
cask "1password-cli"
cask "aerospace"
cask "alacritty"
cask "font-recursive-mono-nerd-font"
cask "neovide-app"
cask "openlens"
cask "qmk-toolbox"
cask "rancher"
cask "wezterm"

# =====================================
# VSCODE EXTENSIONS
# =====================================
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "alefragnani.project-manager"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "andrew-codes.cypress-snippets"
vscode "andrewbeletskiy.sort-css-declarations"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "be5invis.toml"
vscode "be5invis.vscode-custom-css"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradgashler.htmltagwrap"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clinyong.vscode-css-modules"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dirt-lxiv.language-csgo-cfg"
vscode "dlasagno.rasi"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "eww-yuck.yuck"
vscode "figma.figma-vscode-extension"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hilleer.yaml-plus-json"
vscode "iakimov.check-npm-updates"
vscode "jock.svg"
vscode "jsynowiec.vscode-insertdatestring"
vscode "keifererikson.nightfox"
vscode "kimuson.ts-type-expand"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "mvllow.rose-pine"
vscode "nico-castell.linux-desktop-file"
vscode "orta.vscode-jest"
vscode "pnp.polacode"
vscode "pomber.git-file-history"
vscode "pranaygp.vscode-css-peek"
vscode "qiqigou.tpl-lang"
vscode "rebornix.toggle"
vscode "redhat.vscode-yaml"
vscode "rogalmic.bash-debug"
vscode "runarsf.platform-settings"
vscode "shelex.vscode-cy-helper"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "xyc.vscode-mdx-preview"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"

# =====================================
# GO PACKAGES
# =====================================
go "github.com/bootdotdev/bootdev"
